src/Reports/ОтчетПоСменнымЗаданиям/ОтчетПоСменнымЗаданиям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоСменнымЗаданиям</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ЭтапыПроизводственныхЗаданий/ЭтапыПроизводственныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭтапыПроизводственныхЗаданий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </resources>
  <resources>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОтчетПоСменнымЗаданиям/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Отчет.Период.Вариант = ВариантСтандартногоПериода.Сегодня;
КонецПроцедуры
                 
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");	
ОблМТК = Макет.ПолучитьОбласть("МТК");	
ОблПЗ = Макет.ПолучитьОбласть("ПЗ");	
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = НачалоДня(Отчет.Период.ДатаНачала);
ОблШапка.Параметры.ДатаКон = КонецДня(Отчет.Период.ДатаОкончания);
ОблШапка.Параметры.ВыбИсполнитель = Отчет.Исполнитель;
ОблШапка.Параметры.ВыбРМ = Отчет.РабочееМесто;
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
"ВЫБРАТЬ
|	ЭтапыПроизводственныхЗаданий.ДатаНачала,
|	ЭтапыПроизводственныхЗаданий.ДатаОкончания,
|	ЭтапыПроизводственныхЗаданий.ПЗ,
|	ЭтапыПроизводственныхЗаданий.ПЗ.ДокументОснование КАК МТК,
|	ЭтапыПроизводственныхЗаданий.Количество
|ИЗ
|	РегистрСведений.ЭтапыПроизводственныхЗаданий КАК ЭтапыПроизводственныхЗаданий
|ГДЕ
|	ЭтапыПроизводственныхЗаданий.ДатаОкончания МЕЖДУ &ДатаНач И &ДатаКон
|	И ЭтапыПроизводственныхЗаданий.РабочееМесто = &РабочееМесто";
	Если Не Отчет.Исполнитель.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданий.Исполнитель = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель",Отчет.Исполнитель);
	КонецЕсли; 	
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО ЭтапыПроизводственныхЗаданий.ПЗ.НомерОчереди
							  |ИТОГИ ПО МТК";
Запрос.УстановитьПараметр("РабочееМесто",Отчет.РабочееМесто);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
НомСтр = 0;
КолПриб = 0;
КолПрибУсл = 0;
Результат = Запрос.Выполнить();
ВыборкаМТК = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМТК.Следующий() Цикл
	ОблМТК.Параметры.МТК = ВыборкаМТК.МТК;
	ОблМТК.Параметры.НомерМТК = ВыборкаМТК.МТК.Номер;
	ОблМТК.Параметры.Спецификация = СокрЛП(ВыборкаМТК.МТК.Номенклатура.Наименование);
	ТабДок.Вывести(ОблМТК);
	ТабДок.НачатьГруппуСтрок("МТК",Истина);
	ВыборкаДетальныеЗаписи = ВыборкаМТК.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НомСтр = НомСтр + 1;
		ОблПЗ.Параметры.НомСтр = НомСтр;
		ОблПЗ.Параметры.ПЗ = ВыборкаДетальныеЗаписи.ПЗ;
		ОблПЗ.Параметры.НомерПЗ = ВыборкаДетальныеЗаписи.ПЗ.Номер;
		ОблПЗ.Параметры.Количество = ВыборкаДетальныеЗаписи.Количество;
		ОблПЗ.Параметры.ЕдиницаИзмерения = ВыборкаМТК.МТК.Номенклатура.ЕдиницаИзмерения;
		ОблПЗ.Параметры.ВозвратнаяТара = ВыборкаДетальныеЗаписи.ПЗ.ВозвратнаяТара;
		ОблПЗ.Параметры.БарКод = ВыборкаДетальныеЗаписи.ПЗ.БарКод;
		ОблПЗ.Параметры.ДатаНачала = ВыборкаДетальныеЗаписи.ДатаНачала;
		ОблПЗ.Параметры.ДатаОкончания = ВыборкаДетальныеЗаписи.ДатаОкончания;
		ТабДок.Вывести(ОблПЗ);
		КолПриб = КолПриб + ВыборкаДетальныеЗаписи.Количество; 
		КолПрибУсл = КолПрибУсл + ВыборкаДетальныеЗаписи.Количество*ВыборкаДетальныеЗаписи.ПЗ.Изделие.УсловныеПриборы;			
		КонецЦикла;
	ТабДок.ЗакончитьГруппуСтрок();
	КонецЦикла;
ОблКонец.Параметры.КолПриб = КолПриб;
ОблКонец.Параметры.КолПрибУсл = КолПрибУсл;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 4;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
